iamsirid/smart-light-nodemcu-stm32/Projectv2/Src/main.c
int decode(){
	for(int p=0; p<8; p++){
		if(p<3){
			name[p] = buffer[p];
		}
		else if(p>=3){
			addr[p-3] = buffer[p];
		}
	}
	return 0;
}

int operation(){
	if(strcmp(name,(char *)"LED") == 0){
		if(strcmp(addr,(char *)"10001") == 0 && mode[1] == '1'){
			status[1] = '1';
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
			transmit();
		}
		else if(strcmp(addr,(char *)"10000") == 0 && mode[1] == '1'){
			status[1] = '0';
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
			transmit();
		}
		else if(strcmp(addr,(char *)"20001") == 0 && mode[2] == '1'){
			status[2] = '1';
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_SET);
			transmit();
		}
		else if(strcmp(addr,(char *)"20000") == 0 && mode[2] == '1'){
			status[2] = '0';
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_RESET);
			transmit();
		}
		else if(strcmp(addr,(char *)"30001") == 0 && mode[3] == '1'){
			status[3] = '1';
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
			transmit();
		}
		else if(strcmp(addr,(char *)"30000") == 0 && mode[3] == '1'){
			status[3] = '0';
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
			transmit();
		}
		else if(strcmp(addr,(char *)"40001") == 0 && mode[4] == '1'){
			status[4] = '1';
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
			transmit();
		}
		else if(strcmp(addr,(char *)"40000") == 0 && mode[4] == '1'){
			status[4] = '0';
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET);
			transmit();
		}
		else if(strcmp(addr,(char *)"50001") == 0 && mode[5] == '1'){
			status[5] = '1';
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_SET);
			transmit();
		}
		else if(strcmp(addr,(char *)"50000") == 0 && mode[5] == '1'){
			status[5] = '0';
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_RESET);
			transmit();
		}
		else if(strcmp(addr,(char *)"60001") == 0 && mode[6] == '1'){
			status[6] = '1';
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET);
			transmit();
		}
		else if(strcmp(addr,(char *)"60000") == 0 && mode[6] == '1'){
			status[6] = '0';
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET);
			transmit();
		}
	}
	else if(strcmp(name,(char *)"MOD") == 0){
		if(strcmp(addr,(char *)"10001") == 0){
			mode[1] = '1';
			modeTransmit();
		}
		else if(strcmp(addr,(char *)"10002") == 0){
			mode[1] = '2';
			modeTransmit();
			if(mode2status == '0'){
				status[1] = '1';
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
				transmit();
			}
			else if(mode2status == '1'){
				status[1] = '0';
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
				transmit();
			}
		}
		else if(strcmp(addr,(char *)"20001") == 0){
			mode[2] = '1';
			modeTransmit();
		}
		else if(strcmp(addr,(char *)"20002") == 0){
			mode[2] = '2';
			modeTransmit();
			if(mode2status == '0'){
				status[2] = '1';
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_SET);
				transmit();
			}
			else if(mode2status == '1'){
				status[2] = '0';
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_RESET);
				transmit();
			}
		}
		else if(strcmp(addr,(char *)"30001") == 0){
			mode[3] = '1';
			modeTransmit();
		}
		else if(strcmp(addr,(char *)"30002") == 0){
			mode[3] = '2';
			modeTransmit();
			if(mode2status == '0'){
				status[3] = '1';
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
				transmit();
			}
			else if(mode2status == '1'){
				status[3] = '0';
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
				transmit();
			}
		}
		else if(strcmp(addr,(char *)"40001") == 0){
			mode[4] = '1';
			modeTransmit();
		}
		else if(strcmp(addr,(char *)"40002") == 0){
			mode[4] = '2';
			modeTransmit();
			if(mode2status == '0'){
				status[4] = '1';
				HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
				transmit();
			}
			else if(mode2status == '1'){
				status[4] = '0';
				HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET);
				transmit();
			}
		}
		else if(strcmp(addr,(char *)"50001") == 0){
			mode[5] = '1';
			modeTransmit();
		}
		else if(strcmp(addr,(char *)"50002") == 0){
			mode[5] = '2';
			modeTransmit();
			if(mode2status == '0'){
				status[5] = '1';
				HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_SET);
				transmit();
			}
			else if(mode2status == '1'){
				status[5] = '0';
				HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_RESET);
				transmit();
			}
		}
		else if(strcmp(addr,(char *)"60001") == 0){
			mode[6] = '1';
			modeTransmit();
		}
		else if(strcmp(addr,(char *)"60002") == 0){
			mode[6] = '2';
			modeTransmit();
			if(mode2status == '0'){
				status[6] = '1';
				HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET);
				transmit();
			}
			else if(mode2status == '1'){
				status[6] = '0';
				HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET);
				transmit();
			}
		}
	}
	buffer[0] = '0';
	return 0;
}
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	for(int x=0; x<10; x++){
		status[x] = '0';
		mode[x] = '1';
	}
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  /* USER CODE BEGIN 2 */
  //HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
  modeTransmit();
  transmit();
  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

